Autodesk.Revit.DB.UnitType.UT_Stationing
Infrastructure Alignment stationing/distance e.g. 1+020 ft etc.

Autodesk.Revit.DB.UnitType.UT_Speed
Distance interval over time e.g.  m/h etc.

Autodesk.Revit.DB.UnitType.UT_TimeInterval
Interval of time e.g. ms, s, min, h